#### Cluster ☸️ `Production`

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_client_config.default will be read during apply
  # (config refers to values not yet known)
 <= data "google_client_config" "default"  {
      + access_token = (sensitive value)
      + id           = (known after apply)
      + project      = (known after apply)
      + region       = (known after apply)
      + zone         = (known after apply)
    }

  # data.google_container_cluster.default will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "default"  {
      + addons_config                     = (known after apply)
      + authenticator_groups_config       = (known after apply)
      + cluster_autoscaling               = (known after apply)
      + cluster_ipv4_cidr                 = (known after apply)
      + database_encryption               = (known after apply)
      + datapath_provider                 = (known after apply)
      + default_max_pods_per_node         = (known after apply)
      + default_snat_status               = (known after apply)
      + description                       = (known after apply)
      + enable_autopilot                  = (known after apply)
      + enable_binary_authorization       = (known after apply)
      + enable_intranode_visibility       = (known after apply)
      + enable_kubernetes_alpha           = (known after apply)
      + enable_legacy_abac                = (known after apply)
      + enable_shielded_nodes             = (known after apply)
      + enable_tpu                        = (known after apply)
      + endpoint                          = (known after apply)
      + id                                = (known after apply)
      + initial_node_count                = (known after apply)
      + instance_group_urls               = (known after apply)
      + ip_allocation_policy              = (known after apply)
      + label_fingerprint                 = (known after apply)
      + location                          = "europe-west2"
      + logging_service                   = (known after apply)
      + maintenance_policy                = (known after apply)
      + master_auth                       = (known after apply)
      + master_authorized_networks_config = (known after apply)
      + master_version                    = (known after apply)
      + min_master_version                = (known after apply)
      + monitoring_service                = (known after apply)
      + name                              = "prod-cluster"
      + network                           = (known after apply)
      + network_policy                    = (known after apply)
      + networking_mode                   = (known after apply)
      + node_config                       = (known after apply)
      + node_locations                    = (known after apply)
      + node_pool                         = (known after apply)
      + node_version                      = (known after apply)
      + operation                         = (known after apply)
      + pod_security_policy_config        = (known after apply)
      + private_cluster_config            = (known after apply)
      + private_ipv6_google_access        = (known after apply)
      + release_channel                   = (known after apply)
      + remove_default_node_pool          = (known after apply)
      + resource_labels                   = (known after apply)
      + resource_usage_export_config      = (known after apply)
      + self_link                         = (known after apply)
      + services_ipv4_cidr                = (known after apply)
      + subnetwork                        = (known after apply)
      + tpu_ipv4_cidr_block               = (known after apply)
      + vertical_pod_autoscaling          = (known after apply)
      + workload_identity_config          = (known after apply)
    }

  # module.cluster-core.google_kms_crypto_key.db will be created
  + resource "google_kms_crypto_key" "db" {
      + id                            = (known after apply)
      + key_ring                      = (known after apply)
      + name                          = "k8s-db"
      + purpose                       = "ENCRYPT_DECRYPT"
      + rotation_period               = "2592000s"
      + self_link                     = (known after apply)
      + skip_initial_version_creation = false

      + version_template {
          + algorithm        = (known after apply)
          + protection_level = (known after apply)
        }
    }

  # module.cluster-core.google_kms_crypto_key.root_disk will be created
  + resource "google_kms_crypto_key" "root_disk" {
      + id                            = (known after apply)
      + key_ring                      = (known after apply)
      + name                          = "k8s-root-disk"
      + purpose                       = "ENCRYPT_DECRYPT"
      + rotation_period               = "2592000s"
      + self_link                     = (known after apply)
      + skip_initial_version_creation = false

      + version_template {
          + algorithm        = (known after apply)
          + protection_level = (known after apply)
        }
    }

  # module.cluster-core.google_kms_crypto_key.sc_storageclass_cmek_disk will be created
  + resource "google_kms_crypto_key" "sc_storageclass_cmek_disk" {
      + id                            = (known after apply)
      + key_ring                      = (known after apply)
      + name                          = "k8s-sc-storageclass-cmek-disk"
      + purpose                       = "ENCRYPT_DECRYPT"
      + rotation_period               = "2592000s"
      + self_link                     = (known after apply)
      + skip_initial_version_creation = false

      + version_template {
          + algorithm        = (known after apply)
          + protection_level = (known after apply)
        }
    }

  # module.cluster-core.google_kms_crypto_key_iam_binding.crypto_key_db will be created
  + resource "google_kms_crypto_key_iam_binding" "crypto_key_db" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + members       = [
          + "serviceAccount:service-333940749240@container-engine-robot.iam.gserviceaccount.com",
        ]
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.cluster-core.google_kms_crypto_key_iam_binding.crypto_key_root_disk will be created
  + resource "google_kms_crypto_key_iam_binding" "crypto_key_root_disk" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + members       = [
          + "serviceAccount:service-333940749240@compute-system.iam.gserviceaccount.com",
        ]
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.cluster-core.google_kms_crypto_key_iam_binding.crypto_key_sc_storageclass_cmek_disk will be created
  + resource "google_kms_crypto_key_iam_binding" "crypto_key_sc_storageclass_cmek_disk" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + members       = [
          + "serviceAccount:service-333940749240@compute-system.iam.gserviceaccount.com",
        ]
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.cluster-core.google_kms_key_ring.gke will be created
  + resource "google_kms_key_ring" "gke" {
      + id        = (known after apply)
      + location  = "europe-west2"
      + name      = "prod-cluster"
      + project   = "prod-cluster-309309"
      + self_link = (known after apply)
    }

  # module.cluster-mid.helm_release.cert_manager will be created
  + resource "helm_release" "cert_manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                resources:
                  requests:
                    cpu: 10m
                    memory: 64Mi
                  limits:
                    cpu: 100m
                    memory: 128Mi
                
                webhook:
                  resources:
                    requests:
                      cpu: 10m
                      memory: 64Mi
                    limits:
                      cpu: 100m
                      memory: 128Mi
                
                cainjector:
                  resources:
                    requests:
                      cpu: 10m
                      memory: 64Mi
                    limits:
                      cpu: 100m
                      memory: 128Mi
            EOT,
        ]
      + verify                     = false
      + version                    = "v1.1.0"
      + wait                       = true

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
    }

  # module.cluster-mid.helm_release.nginx_ingress will be created
  + resource "helm_release" "nginx_ingress" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress"
      + namespace                  = "nginx-ingress"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                controller:
                  ingressClass: ngx
                  config:
                    use-proxy-protocol: "true"
                    proxy-protocol-header-timeout: "2s"
                    enable-real-ip: "true"
                    proxy-real-ip-cidr: "130.211.0.0/22, 35.191.0.0/16"
                    use-forwarded-headers: "false"
                  service:
                    type: ClusterIP
                    annotations:
                      cloud.google.com/neg: '{"exposed_ports": {"80":{"name": "prod-cluster-309309-nginx-ingress-80"},"443":{"name": "prod-cluster-309309-nginx-ingress-443"}}}'
                  extraArgs:
                    default-ssl-certificate: "nginx-ingress/nginx-ingress-certificate"
                
                # vim: filetype=yaml
            EOT,
        ]
      + verify                     = false
      + version                    = "3.24.0"
      + wait                       = true
    }

  # module.cluster-mid.kubernetes_namespace.cert_manager will be created
  + resource "kubernetes_namespace" "cert_manager" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "cert-manager"
            }
          + generation       = (known after apply)
          + labels           = {
              + "name" = "cert-manager"
            }
          + name             = "cert-manager"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cluster-mid.kubernetes_namespace.nginx_ingress will be created
  + resource "kubernetes_namespace" "nginx_ingress" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "nginx-ingress"
            }
          + generation       = (known after apply)
          + labels           = {
              + "name" = "nginx-ingress"
            }
          + name             = "nginx-ingress"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cluster-core.module.gke.data.google_client_config.default will be read during apply
  # (config refers to values not yet known)
 <= data "google_client_config" "default"  {
      + access_token = (sensitive value)
      + id           = (known after apply)
      + project      = (known after apply)
      + region       = (known after apply)
      + zone         = (known after apply)
    }

  # module.cluster-core.module.gke.data.google_compute_zones.available will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_zones" "available"  {
      + id      = (known after apply)
      + names   = (known after apply)
      + project = "prod-cluster-309309"
      + region  = "europe-west2"
    }

  # module.cluster-core.module.gke.data.google_container_engine_versions.region will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_engine_versions" "region"  {
      + default_cluster_version         = (known after apply)
      + id                              = (known after apply)
      + latest_master_version           = (known after apply)
      + latest_node_version             = (known after apply)
      + location                        = "europe-west2"
      + project                         = "prod-cluster-309309"
      + release_channel_default_version = (known after apply)
      + valid_master_versions           = (known after apply)
      + valid_node_versions             = (known after apply)
    }

  # module.cluster-core.module.gke.data.google_container_engine_versions.zone will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_engine_versions" "zone"  {
      + default_cluster_version         = (known after apply)
      + id                              = (known after apply)
      + latest_master_version           = (known after apply)
      + latest_node_version             = (known after apply)
      + location                        = "europe-west2-a"
      + project                         = "prod-cluster-309309"
      + release_channel_default_version = (known after apply)
      + valid_master_versions           = (known after apply)
      + valid_node_versions             = (known after apply)
    }

  # module.cluster-core.module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = 110
      + enable_binary_authorization = false
      + enable_intranode_visibility = false
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + enable_tpu                  = false
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + instance_group_urls         = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "europe-west2"
      + logging_service             = "logging.googleapis.com/kubernetes"
      + master_version              = (known after apply)
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = "prod-cluster"
      + network                     = "projects/prod-cluster-309309/global/networks/default"
      + networking_mode             = "VPC_NATIVE"
      + node_locations              = [
          + "europe-west2-a",
          + "europe-west2-b",
          + "europe-west2-c",
        ]
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "prod-cluster-309309"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "projects/prod-cluster-309309/regions/europe-west2/subnetworks/default"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + config_connector_config {
              + enabled = false
            }

          + dns_cache_config {
              + enabled = false
            }

          + gce_persistent_disk_csi_driver_config {
              + enabled = true
            }

          + horizontal_pod_autoscaling {
              + disabled = true
            }

          + http_load_balancing {
              + disabled = false
            }

          + istio_config {
              + auth     = "AUTH_MUTUAL_TLS"
              + disabled = true
            }

          + kalm_config {
              + enabled = false
            }

          + network_policy_config {
              + disabled = false
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + autoscaling_profile = "BALANCED"
          + enabled             = false

          + auto_provisioning_defaults {
              + min_cpu_platform = (known after apply)
              + oauth_scopes     = (known after apply)
              + service_account  = (known after apply)
            }
        }

      + cluster_telemetry {
          + type = (known after apply)
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = "ENCRYPTED"
        }

      + default_snat_status {
          + disabled = false
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = (known after apply)
        }

      + maintenance_policy {

          + recurring_window {
              + end_time   = "1970-01-01T08:00:00Z"
              + recurrence = "FREQ=WEEKLY;BYDAY=SU,SA;INTERVAL=1"
              + start_time = "1970-01-01T02:00:00Z"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + network_policy {
          + enabled  = true
          + provider = "CALICO"
        }

      + node_config {
          + boot_disk_kms_key = (known after apply)
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + ephemeral_storage_config {
              + local_ssd_count = (known after apply)
            }

          + kubelet_config {
              + cpu_cfs_quota        = (known after apply)
              + cpu_cfs_quota_period = (known after apply)
              + cpu_manager_policy   = (known after apply)
            }

          + linux_node_config {
              + sysctls = (known after apply)
            }

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count  = 0
          + instance_group_urls = (known after apply)
          + max_pods_per_node   = (known after apply)
          + name                = "default-pool"
          + name_prefix         = (known after apply)
          + node_count          = (known after apply)
          + node_locations      = (known after apply)
          + version             = (known after apply)

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = false
              + service_account   = (known after apply)
              + taint             = (known after apply)

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = "GKE_METADATA_SERVER"
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + notification_config {
          + pubsub {
              + enabled = false
            }
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + vertical_pod_autoscaling {
          + enabled = false
        }

      + workload_identity_config {
          + identity_namespace = "prod-cluster-309309.svc.id.goog"
        }
    }

  # module.cluster-core.module.gke.google_container_node_pool.pools["default-node-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster             = "prod-cluster"
      + id                  = (known after apply)
      + initial_node_count  = 1
      + instance_group_urls = (known after apply)
      + location            = "europe-west2"
      + max_pods_per_node   = (known after apply)
      + name                = "default-node-pool"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + operation           = (known after apply)
      + project             = "prod-cluster-309309"
      + version             = (known after apply)

      + autoscaling {
          + max_node_count = 4
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + boot_disk_kms_key = (known after apply)
          + disk_size_gb      = 60
          + disk_type         = "pd-standard"
          + guest_accelerator = []
          + image_type        = "COS_CONTAINERD"
          + labels            = {
              + "cluster_name"      = "prod-cluster"
              + "default-node-pool" = "true"
              + "node_pool"         = "default-node-pool"
            }
          + local_ssd_count   = 0
          + machine_type      = "e2-medium"
          + metadata          = {
              + "cluster_name"                    = "prod-cluster"
              + "disable-legacy-endpoints"        = "true"
              + "node-pool-metadata-custom-value" = "my-node-pool"
              + "node_pool"                       = "default-node-pool"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = (known after apply)
          + tags              = [
              + "gke-prod-cluster",
              + "gke-prod-cluster-default-node-pool",
              + "load-balanced-backend",
              + "default-node-pool",
            ]
          + taint             = [
              + {
                  + effect = "PREFER_NO_SCHEDULE"
                  + key    = "default-node-pool"
                  + value  = "true"
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + node_metadata = "GKE_METADATA_SERVER"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = 1
          + max_unavailable = 0
        }
    }

  # module.cluster-core.module.gke.google_project_iam_member.cluster_service_account-artifact-registry["prod-cluster-309309"] will be created
  + resource "google_project_iam_member" "cluster_service_account-artifact-registry" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prod-cluster-309309"
      + role    = "roles/artifactregistry.reader"
    }

  # module.cluster-core.module.gke.google_project_iam_member.cluster_service_account-gcr["prod-cluster-309309"] will be created
  + resource "google_project_iam_member" "cluster_service_account-gcr" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prod-cluster-309309"
      + role    = "roles/storage.objectViewer"
    }

  # module.cluster-core.module.gke.google_project_iam_member.cluster_service_account-log_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prod-cluster-309309"
      + role    = "roles/logging.logWriter"
    }

  # module.cluster-core.module.gke.google_project_iam_member.cluster_service_account-metric_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-metric_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prod-cluster-309309"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.cluster-core.module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-monitoring_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prod-cluster-309309"
      + role    = "roles/monitoring.viewer"
    }

  # module.cluster-core.module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-resourceMetadata-writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prod-cluster-309309"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.cluster-core.module.gke.google_service_account.cluster_service_account[0] will be created
  + resource "google_service_account" "cluster_service_account" {
      + account_id   = (known after apply)
      + display_name = "Terraform-managed service account for cluster prod-cluster"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "prod-cluster-309309"
      + unique_id    = (known after apply)
    }

  # module.cluster-core.module.gke.random_shuffle.available_zones will be created
  + resource "random_shuffle" "available_zones" {
      + id           = (known after apply)
      + input        = (known after apply)
      + result       = (known after apply)
      + result_count = 3
    }

  # module.cluster-core.module.gke.random_string.cluster_service_account_suffix will be created
  + resource "random_string" "cluster_service_account_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.cluster-core.module.gke.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.null_resource.module_depends_on[0] will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "3"
        }
    }

Plan: 23 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @vicpara, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*